In [14]:
'H₀: The ratio of Jeopardy questions about men compared to women does not change over time.'
'H₁: The ratio of Jeopardy questions about men compared to women does change over time.'

'H₁: The ratio of Jeopardy questions about men compared to women does change over time.'

In [15]:
from pathlib import Path
import pandas as pd
import numpy as np

In [16]:
df1= pd.read_csv('/workspaces/jeopardy_hypths_1/data/Jeopardy .csv')
print(df1.shape)
print(list(df1.columns))

(216930, 7)
['Show Number', ' Air Date', ' Round', ' Category', ' Value', ' Question', ' Answer']

In [17]:
df1.columns= (
    df1.columns
    .str.strip()
    .str.lower()
    .str.replace(' ','_')
)

print(list(df1.columns))

v1= df1[['question','answer','air_date','value']].copy()
v1.head(3)

['show_number', 'air_date', 'round', 'category', 'value', 'question', 'answer']

,question,answer,air_date,value
0,"For the last 8 years of his life, Galileo was ...",Copernicus,2004-12-31,$200
1,No. 2: 1912 Olympian; football star at Carlisl...,Jim Thorpe,2004-12-31,$200
2,The city of Yuma in this state has a record av...,Arizona,2004-12-31,$200

In [18]:
v1['air_date']= pd.to_datetime(v1['air_date'],errors= 'coerce')
v1['year']= v1['air_date'].dt.year
print(v1[['air_date','year']].head(5))
print('rows that have no year:', v1['year'].isna().sum())

    air_date  year
0 2004-12-31  2004
1 2004-12-31  2004
2 2004-12-31  2004
3 2004-12-31  2004
4 2004-12-31  2004
rows that have no year: 0

In [19]:
k_t='/workspaces/jeopardy_hypths_1/data/kids_teen.tsv'
kids= pd.read_table(k_t)
print(kids.shape)
print(list(kids.columns))
kids.head(5)

(20800, 9)
['round', 'value', 'daily_double', 'category', 'comments', 'answer', 'question', 'air_date', 'notes']

,round,value,daily_double,category,comments,answer,question,air_date,notes
0,1,100,no,BIRDS,-,The bat parrot probably got its name from slee...,upside-down,1987-02-16,1987 Teen Tournament quarterfinal game 1.
1,1,200,no,BIRDS,-,"Too ""lei""zy to migrate, the geese in this trop...",Hawaii,1987-02-16,1987 Teen Tournament quarterfinal game 1.
2,1,300,no,BIRDS,-,A bird waterproofs its feathers with oil from ...,its tail,1987-02-16,1987 Teen Tournament quarterfinal game 1.
3,1,100,no,THE LIBRARY,-,Defacing books or shouting or throwing spitbal...,three activities prohibited in the library,1987-02-16,1987 Teen Tournament quarterfinal game 1.
4,1,200,no,THE LIBRARY,-,"On most reference books in your local library,...",R,1987-02-16,1987 Teen Tournament quarterfinal game 1.

In [21]:
v2= kids[['question','answer','air_date','value']].copy()
v2['year']= pd.to_numeric(v2['air_date'].astype(str).str[:4],errors= 'coerce')
print(v2.shape)
v2.head(5)
print('rows with no year:', v2['year'].isna().sum())

(20800, 5)
rows with no year: 0

In [22]:
m_t='/workspaces/jeopardy_hypths_1/data/master_1-35.tsv'
master= pd.read_table(m_t)
print(master.shape)
print(list(master.columns)[:12])
master.head(3)

(349641, 9)
['round', 'value', 'daily_double', 'category', 'comments', 'answer', 'question', 'air_date', 'notes']

,round,value,daily_double,category,comments,answer,question,air_date,notes
0,1,100,no,LAKES & RIVERS,-,River mentioned most often in the Bible,the Jordan,1984-09-10,-
1,1,200,no,LAKES & RIVERS,-,Scottish word for lake,loch,1984-09-10,-
2,1,400,no,LAKES & RIVERS,-,American river only 33 miles shorter than the ...,the Missouri,1984-09-10,-

In [26]:
v3=master[['question','answer','air_date','value']].copy()
v3['year']= pd.to_numeric(v3['air_date'].astype(str).str[:4], errors= 'coerce')
print(v3.shape)
v3.head(5)
print('rows with no year',v3['year'].isna().sum())

(349641, 5)
rows with no year 0

In [28]:
allt= pd.concat([v1,v2,v3], ignore_index=True)
print('combined shape:', allt.shape)
allt.head(5)

combined shape: (587371, 5)

,question,answer,air_date,value,year
0,"For the last 8 years of his life, Galileo was ...",Copernicus,2004-12-31 00:00:00,$200,2004
1,No. 2: 1912 Olympian; football star at Carlisl...,Jim Thorpe,2004-12-31 00:00:00,$200,2004
2,The city of Yuma in this state has a record av...,Arizona,2004-12-31 00:00:00,$200,2004
3,"In 1963, live on ""The Art Linkletter Show"", th...",McDonald's,2004-12-31 00:00:00,$200,2004
4,"Signer of the Dec. of Indep., framer of the Co...",John Adams,2004-12-31 00:00:00,$200,2004

In [29]:
allt=allt[allt['year'].notna() & allt['answer'].astype(str).str.strip().ne('')].copy()
print(allt.shape)

(587371, 5)